GT3/setup_TM/RANS-koSSTv2/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    lowerWall
    {
	//OK
        //type            fixedValue;
        //value           uniform 0;

	//OK
        //type 		nutLowReWallFunction;
        //value           uniform 0;

	//OK
        type 		nutUSpaldingWallFunction;
        value           uniform 0;
    }
    lowerSymmetry
    {
        type            calculated;
        value           uniform 0;
    }
    upperSymmetry
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
